DataProcessors/ИнтеграцияХабрКарьера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияХабрКарьера</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияМаркераДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСайта</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияХабрКарьера/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Сайт() Экспорт
	
	Возврат Справочники.ИсточникиИнформацииОКандидатах.ХабрКарьера;
	
КонецФункции

Функция НовыйМенеджер(Пользователь) Экспорт
	
	Менеджер = Создать();
	
	Менеджер.Сайт = Сайт();
	Менеджер.Пользователь = Пользователь;
	Менеджер.ДанныеСайта = ДанныеСайта();
	
	Возврат Менеджер;
	
КонецФункции

Функция ДанныеСайта() Экспорт
	
	ДанныеСайта = РекрутинговыеСайтыСлужебный.НовыеДанныеСайта();
	
	ДанныеСайта.Имя = Имя();
	ДанныеСайта.ИмяСайта = ИмяСайта();
	ДанныеСайта.Представление = Представление();
	ДанныеСайта.АдресЗапроса = АдресЗапроса();
	ДанныеСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.Логотип = Логотип();
	
	ДанныеСайта.ДоступенПоискРезюме = Ложь;
	ДанныеСайта.ДоступнаЗагрузкаКомментариевКандидатов = Ложь;
	
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("company", "companies");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("currency", "currency");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("city_id", "cities");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("remote", "remote");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("employment_type", "employment_type");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("skills", "skills");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("specialization_ids", "specializations");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("placement_type", "placement_type");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("skip_placement", "skip_placement");
	
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Наименование = "title";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.ПредполагаемыйДоход = "salary_to";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Описание = "description";
	
	ДанныеСайта.ИменаПутейКДаннымВакансии.Вакансия = "title";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Адрес = "url";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор = "id";
	
	ДанныеСайта.ШаблоныСтраницСайта.Сайт = Сайт();
	ДанныеСайта.ШаблоныСтраницСайта.Логотип = Логотип();
	ДанныеСайта.ШаблоныСтраницСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.ШаблоныСтраницСайта.ШаблонURLРезюме = "https://*.habr.com/*";
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLСайта = "https:\/\/((.*?\.habr)|(habr))\.com\/.*"; 
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLРезюме =
		"https:\/\/((.*?\.habr)|(habr))\.com\/(?!vacancies|resumes|companies|salaries|courses|journal|profile|info|conversations|responses)\S+";
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляХабрКарьера();
	АдресАвторизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1?client_id=%2&redirect_uri=%3&response_type=code",
				ИдентификаторПриложения.auth_uri,
				ИдентификаторПриложения.client_id,
				ИдентификаторПриложения.redirect_uri);
	ДанныеСайта.АдресАвторизации = АдресАвторизации;
	
	ЗаполнитьПараметрыФорм(ДанныеСайта);
	
	Возврат ДанныеСайта;
	
КонецФункции

#Область Интерфейс

// Параметры:
//  АдресаСайтов - Массив Из см. РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта
Процедура ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов) Экспорт
	
	АдресаСайтов.Добавить(
		РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта(Представление(), АдресЗапроса()));
	
КонецПроцедуры

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ПараметрыПодключения - Структура: См. РекрутинговыеСайтыКлиент.НовыеПараметрыПодключения
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.Подключить
Функция Подключить(МенеджерСайта, ПараметрыПодключения) Экспорт
	
	Возврат МенеджерСайта.Подключить(ПараметрыПодключения.КодАвторизации);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ПроверитьПодключение
Функция ПроверитьПодключение(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ПроверитьПодключение();
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ЗагрузитьКлассификаторы
Функция ЗагрузитьКлассификаторы(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ЗагрузитьКлассификаторы();
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ИнформацияОПользователе
Функция ИнформацияОПользователе(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ИнформацияОПользователе();
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  БылиОшибки - Булево
// 
// Возвращаемое значение:
//  Массив из Структура
Функция ВакансииССайта(МенеджерСайта, БылиОшибки) Экспорт
	
	Возврат МенеджерСайта.ВакансииССайта(БылиОшибки);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Вакансия - Структура
//  Реквизит - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ЗначениеРеквизитаПубликацииПоУмолчанию
Функция ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит) Экспорт
	
	Возврат МенеджерСайта.ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Вакансия - СправочникСсылка.Вакансии
//  Дерево - ДеревоЗначений: См. РекрутинговыеСайтыСлужебный.НовоеДеревоПубликацииВакансии
//  СтруктураВакансииССайта - Структура
Процедура ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	МенеджерСайта.ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта);
	
КонецПроцедуры

// Виды полей.
// 
// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ВидыПолей
Функция ВидыПолей(МенеджерСайта, ОбновлениеПубликации) Экспорт
	
	Возврат МенеджерСайта.ВидыПолей(ОбновлениеПубликации);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ИмяСписка - Строка
//  Значение - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ЭлементКлассификатора
Функция ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение) Экспорт
	
	Возврат МенеджерСайта.ЭлементКлассификатора(ИмяСписка, Значение);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Путь - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.СписокВыбораПоКлассификатору
Функция СписокВыбораПоКлассификатору(МенеджерСайта, Путь) Экспорт
	
	Возврат МенеджерСайта.СписокВыбораПоКлассификатору(Путь);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПолучитьОтклики(МенеджерСайта, Вакансия) Экспорт
	
	МенеджерСайта.ПолучитьОтклики(Вакансия);
	
КонецПроцедуры

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ДоступныеДляПолученияКонтакты
Функция ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ДоступныеДляПолученияКонтакты(АдресРезюме);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ПоляВакансии
Функция ПоляВакансии(МенеджерСайта, ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	Возврат МенеджерСайта.ПоляВакансии(ОбновлениеПубликации);
	
КонецФункции

// Параметры:
//  МенеджерСайта - См. НовыйМенеджер
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторРезюмеПоАдресу(МенеджерСайта, Знач АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.АдресВакансии
Функция АдресВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.АдресВакансии(ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  МенеджерСайта - См. НовыйМенеджер
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	Возврат МенеджерСайта.ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ОпубликоватьВакансию
Функция ОпубликоватьВакансию(МенеджерСайта, Дерево) Экспорт
	
	Возврат МенеджерСайта.ОпубликоватьВакансию(Дерево);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ПовторноОпубликоватьВакансию
Функция ПовторноОпубликоватьВакансию(МенеджерСайта, Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Дерево - ДеревоЗначений
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ОбновитьПубликациюВакансии
Функция ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.СнятьПубликациюВакансии
Функция СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СнятьПубликациюВакансии(ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.СвойстваПубликацииВакансииНаСайте
Функция СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  Классификатор - Строка
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.ЗаполнитьДеревоКлассификатора
Функция ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево) Экспорт
	
	Возврат МенеджерСайта.ЗаполнитьДеревоКлассификатора(Классификатор, Дерево);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияХабрКарьера -
//  КодСостояния - Число
//  ОписаниеОшибки - Строка
// 
// Возвращаемое значение:
//  См. ОбработкаОбъект.ИнтеграцияХабрКарьера.УточнитьОписаниеОшибки
Функция УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки) Экспорт
	
	Возврат МенеджерСайта.УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Имя()
	
	Возврат "ХабрКарьера";
	
КонецФункции

Функция ИмяСайта()
	
	Возврат "career.habr.com";
	
КонецФункции

Функция Представление()
	
	Возврат НСтр("ru = 'Хабр Карьера'");
	
КонецФункции

Функция АдресЗапроса()
	
	Возврат "career.habr.com/api";
	
КонецФункции

Функция ГлавнаяСтраница()
	
	Возврат "https://career.habr.com/";
	
КонецФункции

Функция Логотип()
	
	Возврат БиблиотекаКартинок.ХабрКарьера;
	
КонецФункции

Процедура ЗаполнитьПараметрыФорм(ДанныеСайта)
	
	ДанныеСайта.ПараметрыФорм.НастройкаДоступа.ВыводитьКодАвторизации = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
